{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/jack/Dropbox/Documents/Teaching/PUBLPOL330D/Lectures/Lecture 9/markdown/lecture9_markdown.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 3 Mar 2020, 17:54:42
{txt}
{com}. //_1
. set seed 123
{txt}
{com}. set obs 2000
{txt}{p}
number of observations (_N)  was 0,
now 2,000
{p_end}

{com}. // state names
. gen state_name = "Oregon"
{txt}
{com}. replace state_name = "Washington" if _n >= 1001
{txt}variable {bf}state_name{sf} was {bf}{res}str6{sf}{txt} now {bf}{res}str10{sf}
{txt}(1,000 real changes made)

{com}. encode state_name, gen(state)
{txt}
{com}. // time
. gen t = 2015
{txt}
{com}. replace t = 2017 if state == 1 & _n >= 501
{txt}(500 real changes made)

{com}. replace t = 2017 if state == 2 & _n >= 1501
{txt}(500 real changes made)

{com}. // simulate employment
. gen cut = 0.7
{txt}
{com}. replace cut = 0.8 if state == 1 & t == 2017
{txt}(500 real changes made)

{com}. replace cut = 0.5 if state == 2 & t == 2015
{txt}(500 real changes made)

{com}. replace cut = 0.7 if state == 2 & t == 2017
{txt}(0 real changes made)

{com}. gen runif = runiform(0,1)
{txt}
{com}. gen employed = 0
{txt}
{com}. replace employed = 1 if runif <= cut
{txt}(1,361 real changes made)

{com}. //_2
. sum employed if t == 2015 & state == 1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}employed {c |}{res}        500        .694    .4612912          0          1
{txt}
{com}. sum employed if t == 2017 & state == 1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}employed {c |}{res}        500        .792    .4062833          0          1
{txt}
{com}. //_3
. sum employed if t == 2015 & state == 2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}employed {c |}{res}        500         .48    .5001002          0          1
{txt}
{com}. sum employed if t == 2017 & state == 2

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}employed {c |}{res}        500        .756    .4299229          0          1
{txt}
{com}. //_4
. reg employed i.state##i.t

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     2,000
{txt}{hline 13}{c +}{hline 34}   F(3, 1996)      = {res}    48.00
{txt}       Model {c |} {res}    29.2575         3      9.7525   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res}    405.582     1,996  .203197395   {txt}R-squared       ={res}    0.0673
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0659
{txt}       Total {c |} {res}   434.8395     1,999  .217528514   {txt}Root MSE        =   {res} .45077

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}    employed{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}state {c |}
{space 1}Washington  {c |}{col 14}{res}{space 2}    -.214{col 26}{space 2} .0285095{col 37}{space 1}   -7.51{col 46}{space 3}0.000{col 54}{space 4}-.2699114{col 67}{space 3}-.1580886
{txt}{space 12} {c |}
{space 11}t {c |}
{space 7}2017  {c |}{col 14}{res}{space 2}     .098{col 26}{space 2} .0285095{col 37}{space 1}    3.44{col 46}{space 3}0.001{col 54}{space 4} .0420886{col 67}{space 3} .1539114
{txt}{space 12} {c |}
{space 5}state#t {c |}
{space 1}Washington #{c |}
{space 7}2017  {c |}{col 14}{res}{space 2}     .178{col 26}{space 2} .0403185{col 37}{space 1}    4.41{col 46}{space 3}0.000{col 54}{space 4} .0989293{col 67}{space 3} .2570707
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}     .694{col 26}{space 2} .0201592{col 37}{space 1}   34.43{col 46}{space 3}0.000{col 54}{space 4} .6544647{col 67}{space 3} .7335353
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/jack/Dropbox/Documents/Teaching/PUBLPOL330D/Lectures/Lecture 9/markdown/lecture9_markdown.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 3 Mar 2020, 17:54:42
{txt}{.-}
{smcl}
{txt}{sf}{ul off}