{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/jack/Dropbox/Documents/Teaching/PUBLPOL330D/Lectures/Lecture 1/markdown slides/lecture1_markdown_slides.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 2 Jan 2020, 16:20:25
{txt}
{com}. //_1
. /* Lecture 1
> PUBLPOL 330D Winter 2020
> Jack Blundell 
> */
. //_2
. /*
> Worked example of analysis of lalonde 1986 data.
> Structure:
> 0. Setup
> 1. Import raw data
> 2. Clean data
> 3. Explore data
> 4. Test for differences in means by group 
> */    
. //_3
. clear
{txt}
{com}. //_4
. set more off
{txt}
{com}. //_5
. cd "~/Dropbox/Documents/Teaching/PUBLPOL330D/Lectures/Lecture 1/markdown slides"
{res}/Users/jack/Dropbox/Documents/Teaching/PUBLPOL330D/Lectures/Lecture 1/markdown slides
{txt}
{com}. //_6
. // capture log close
. //_7
. //log using "lecture1log", replace
. //_8
. import delimited "lalonde_experiment.txt", delimiter(" ", collapse)
{res}{text}(3 vars, 446 obs)

{com}. //_9
. drop v1
{txt}
{com}. //_10
. rename v2 t
{res}{txt}
{com}. rename v3 y
{res}{txt}
{com}. //_11
. label variable t "Treatment"
{txt}
{com}. label variable y "Earnings ($1,000's)"
{txt}
{com}. //_12
. describe

{txt}Contains data
  obs:{res}           446                          
{txt} vars:{res}             2                          
{txt} size:{res}         4,460                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:t              }{txt}{bind: str6    }{bind:{txt}%9s       }{space 1}{bind:         }{bind:  }{res}{res}Treatment{p_end}
{p 0 48}{bind:y              }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Earnings ($1,000's){p_end}
{txt}{hline}
Sorted by: 
{res}     Note: Dataset has changed since last saved.
{txt}
{com}. //_13
. destring t, replace force
{txt}t: contains nonnumeric characters; {res}replaced {txt}as {res}byte
{txt}(1 missing value generated)
{res}{txt}
{com}. //_14
. des

{txt}Contains data
  obs:{res}           446                          
{txt} vars:{res}             2                          
{txt} size:{res}         2,230                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:t              }{txt}{bind: byte    }{bind:{txt}%10.0g    }{space 1}{bind:         }{bind:  }{res}{res}Treatment{p_end}
{p 0 48}{bind:y              }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}Earnings ($1,000's){p_end}
{txt}{hline}
Sorted by: 
{res}     Note: Dataset has changed since last saved.
{txt}
{com}. //_15
. generate missing_y = 0
{txt}
{com}. replace missing_y = 1 if y == .
{txt}(1 real change made)

{com}. //_16
. tabulate missing_y

  {txt}missing_y {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        445       99.78       99.78
{txt}          1 {c |}{res}          1        0.22      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        446      100.00
{txt}
{com}. //_17
. drop if missing_y == 1
{txt}(1 observation deleted)

{com}. //_18
. save "lalonde_clean.dta", replace
{txt}file lalonde_clean.dta saved

{com}. //_19
. use "lalonde_clean.dta", clear
{txt}
{com}. //_20
. summarize y

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 11}y {c |}{res}        445    5.300762     6.63149          0    60.3079
{txt}
{com}. //_21
. sum y, detail

                     {txt}Earnings ($1,000's)
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}        445
{txt}25%    {res}        0              0       {txt}Sum of Wgt. {res}        445

{txt}50%    {res}   3.7018                      {txt}Mean          {res} 5.300762
                        {txt}Largest       Std. Dev.     {res}  6.63149
{txt}75%    {res}   8.1247        34.0993
{txt}90%    {res}   12.804        36.6469       {txt}Variance      {res} 43.97666
{txt}95%    {res}  16.9882        39.4835       {txt}Skewness      {res} 2.622092
{txt}99%    {res}  26.8176        60.3079       {txt}Kurtosis      {res} 16.09979
{txt}
{com}. //_22
. tab t

  {txt}Treatment {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        260       58.43       58.43
{txt}          1 {c |}{res}        185       41.57      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}        445      100.00
{txt}
{com}. //_23
. histogram y, width(1)
{txt}(bin={res}61{txt}, start={res}0{txt}, width={res}1{txt})
{res}{txt}
{com}. graph export "histogram_y.png", width(500) replace
{txt}(file histogram_y.png written in PNG format)

{com}. //_24
. sum y if t == 0

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 11}y {c |}{res}        260      4.5548    5.483835          0    39.4835
{txt}
{com}. sum y if t == 1

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 11}y {c |}{res}        185    6.349142    7.867401          0    60.3079
{txt}
{com}. //_25
. graph box y, by(t)
{res}{txt}
{com}. graph export "boxplot_y_by_t.png", width(500) replace
{err}could not find Graph window
{txt}{search r(693), local:r(693);}

end of do-file

{com}. 
{txt}end of do-file

{com}. do "/var/folders/8l/dplrmsx134g565k982qm4qb00000gn/T//SD04190.000000"
{txt}
{com}. /* make_markdown
> 
> */
. 
.  cd "~/Dropbox/Documents/Teaching/PUBLPOL330D/Lectures/Lecture 1/markdown/"
{res}/Users/jack/Dropbox/Documents/Teaching/PUBLPOL330D/Lectures/Lecture 1/markdown
{txt}
{com}.  markstat using lecture1_markdown.stmd, bundle
{res}{txt}
{com}. capture log close
{smcl}
{com}{sf}{ul off}